module Imcgss.UnitFinder.Preset exposing (Preset, all)

import Imcgss.UnitFinder.Idol exposing (Idol)
import Set exposing (Set)


type alias Preset =
    { name : String
    , performers : Set Idol
    }


all : List Preset
all =
    [ { name = "STARLIGHT STAGE 1日目"
      , performers =
          Set.fromList
              [ "一ノ瀬志希"
              , "早坂美玲"
              , "三村かな子"
              , "古賀小春"
              , "黒埼ちとせ"
              , "中野有香"
              , "白雪千夜"
              , "宮本フレデリカ"
              , "小早川紗枝"
              , "椎名法子"
              , "乙倉悠貴"
              , "遊佐こずえ"
              , "棟方愛海"
              , "速水奏"
              , "結城晴"
              , "藤原肇"
              , "森久保乃々"
              , "荒木比奈"
              , "川島瑞樹"
              , "久川 颯"
              , "佐城雪美"
              , "上条春菜"
              , "八神マキノ"
              , "望月 聖"
              , "三船美優"
              , "鷹富士茄子"
              , "相葉夕美"
              , "赤城みりあ"
              , "依田芳乃"
              , "久川 凪"
              , "的場梨沙"
              , "及川雫"
              , "十時愛梨"
              , "龍崎薫"
              , "諸星きらり"
              , "イヴ・サンタクロース"
              , "城ヶ崎莉嘉"
              , "城ヶ崎美嘉"
              ]
      }
    , { name = "STARLIGHT STAGE 2日目"
      , performers =
          Set.fromList
              [ "関 裕美"
              , "白菊ほたる"
              , "西園寺琴歌"
              , "双葉 杏"
              , "辻野あかり"
              , "島村卯月"
              , "藤本里奈"
              , "輿水幸子"
              , "小日向美穂"
              , "道明寺歌鈴"
              , "佐久間まゆ"
              , "多田李衣菜"
              , "浅利七海"
              , "白坂小梅"
              , "大石泉"
              , "脇山珠美"
              , "桐生つかさ"
              , "松永 涼"
              , "砂塚あきら"
              , "渋谷 凛"
              , "北条加蓮"
              , "神谷奈緒"
              , "大和亜季"
              , "日野 茜"
              , "ナターリア"
              , "高森藍子"
              , "南条 光"
              , "堀 裕子"
              , "喜多見 柚"
              , "浜口あやめ"
              , "小関麗奈"
              , "向井拓海"
              , "喜多日菜子"
              , "夢見りあむ"
              , "星輝子"
              , "木村夏樹"
              , "大槻 唯"
              ]
      }
    , { name = "Luminaria Tiara (xR 土曜 1 部)"
      , performers =
          Set.fromList
              [ "赤城みりあ"
              , "安部菜々"
              , "輿水幸子"
              , "佐藤 心"
              , "島村卯月"
              , "城ヶ崎美嘉"
              , "城ヶ崎莉嘉"
              , "辻野あかり"
              , "久川 凪"
              , "久川 颯"
              , "双葉 杏"
              , "本田未央"
              , "森久保乃々"
              , "諸星きらり"
              , "夢見りあむ"
              ]
      }
    , { name = "Nocturne Crown (xR 土曜 2 部)"
      , performers =
          Set.fromList
              [ "一ノ瀬志希"
              , "大槻 唯"
              , "神谷奈緒"
              , "神崎蘭子"
              , "鷺沢文香"
              , "塩見周子"
              , "渋谷 凛"
              , "砂塚あきら"
              , "高垣 楓"
              , "橘 ありす"
              , "早坂美玲"
              , "速水 奏"
              , "北条加蓮"
              , "星 輝子"
              , "宮本フレデリカ"
              ]
      }
    , { name = "Princess Riot (xR 日曜 1 部)"
      , performers =
          Set.fromList
              [ "速水 奏"
              , "塩見周子"
              , "城ヶ崎美嘉"
              , "一ノ瀬志希"
              , "宮本フレデリカ"
              , "アナスタシア"
              , "大槻 唯"
              , "神谷奈緒"
              , "小早川紗枝"
              , "白坂小梅"
              , "新田美波"
              , "早坂美玲"
              , "久川 颯"
              , "北条加蓮"
              , "星 輝子"
              , "森久保乃々"
              , "諸星きらり"
              ]
      }
    , { name = "Ever Starlight (xR 日曜 2 部)"
      , performers =
          Set.fromList
              [ "島村卯月"
              , "渋谷 凛"
              , "本田未央"
              , "辻野あかり"
              , "砂塚あきら"
              , "夢見りあむ"
              , "赤城みりあ"
              , "安部菜々"
              , "輿水幸子"
              , "鷺沢文香"
              , "佐藤 心"
              , "橘 ありす"
              ]
      }
    , { name = "CONCEPT xR (コドモ×オトナ)"
      , performers =
          Set.fromList
              [ "赤城みりあ"
              , "浅利七海"
              , "市原仁奈"
              , "佐城雪美"
              , "椎名法子"
              , "龍崎薫"
              , "川島瑞樹"
              , "佐藤 心"
              , "高垣 楓"
              , "鷹富士茄子"
              , "三船美優"
              , "大和亜季"
              , "池袋晶葉"
              , "黒川千秋"
              , "財前時子"
              , "篠原 礼"
              , "高橋礼子"
              , "東郷あい"
              , "柊志乃"
              ]
      }
    ]
